Repository: t-regbs/MathAlarm
Catalog: iosApp/iosApp/Localizable.xcstrings
Source language: en
Languages: bn, de, es, hi, pa, pt, ru, zh

source: %@ alarm
bn: %@ অ্যালার্ম
es: Alarma %@
hi: %@ अलार्म
pa: %@ ਅਲਾਰਮ
pt: Alarme %@
ru: Будильник %@
zh: %@闹钟

source: %@ divided by %@
bn: %@ ভাগ %@
de: %@ geteilt durch %@
es: %@ dividido entre %@
hi: %@ भाग %@
pa: %@ ਭਾਗ %@
pt: %@ dividido por %@
ru: %@ разделить на %@
zh: %@ 除以 %@

source: %@ minus %@
bn: %@ বিয়োগ %@
es: %@ menos %@
hi: %@ घटा %@
pa: %@ ਘਟਾਓ %@
pt: %@ menos %@
ru: %@ минус %@
zh: %@ 减 %@

source: %@ multiplied by %@
bn: %@ গুণ %@
de: %@ mal %@
es: %@ multiplicado por %@
hi: %@ गुणा %@
pa: %@ ਗੁਣਾ %@
pt: %@ multiplicado por %@
ru: %@ умножить на %@
zh: %@ 乘 %@

source: %@ plus %@
bn: %@ যোগ %@
es: %@ más %@
hi: %@ जोड़ %@
pa: %@ ਜੋੜ %@
pt: %@ mais %@
ru: %@ плюс %@
zh: %@ 加 %@

source: %lld questions
bn: %lldটি প্রশ্ন
de: %lld Aufgaben
es: %lld preguntas
hi: %lld सवाल
pa: %lld ਸਵਾਲ
pt: %lld perguntas
ru: %lld вопроса
zh: %lld道题

source: A delivered alarm has priority over tone previews.
bn: বাজতে থাকা অ্যালার্ম ধ্বনি প্রিভিউয়ের চেয়ে অগ্রাধিকার পায়।
de: Ein ausgelöster Alarm hat Vorrang vor der Tonvorschau.
es: Una alarma activa tiene prioridad sobre la escucha de tonos.
hi: बज रहे अलार्म को ध्वनि पूर्वावलोकन पर प्राथमिकता मिलती है।
pa: ਵੱਜ ਰਹੇ ਅਲਾਰਮ ਨੂੰ ਧੁਨ ਦੀ ਪੂਰਵ-ਝਲਕ ਉੱਤੇ ਤਰਜੀਹ ਮਿਲਦੀ ਹੈ।
pt: Um alarme ativo tem prioridade sobre a prévia dos sons.
ru: Сработавший будильник имеет приоритет перед прослушиванием.
zh: 已触发的闹钟优先于铃声试听。

source: Add alarm
bn: অ্যালার্ম যোগ করুন
de: Alarm hinzufügen
es: Añadir alarma
hi: अलार्म जोड़ें
pa: ਅਲਾਰਮ ਜੋੜੋ
pt: Adicionar alarme
ru: Добавить будильник
zh: 添加闹钟

source: Add an alarm to get started.
bn: শুরু করতে একটি অ্যালার্ম যোগ করুন।
de: Füge einen Alarm hinzu, um zu beginnen.
es: Añade una alarma para empezar.
hi: शुरू करने के लिए अलार्म जोड़ें।
pa: ਸ਼ੁਰੂ ਕਰਨ ਲਈ ਅਲਾਰਮ ਜੋੜੋ।
pt: Adicione um alarme para começar.
ru: Добавьте будильник, чтобы начать.
zh: 添加闹钟以开始使用。

source: Add or edit an alarm, then tap %@.
bn: অ্যালার্ম যোগ বা সম্পাদনা করুন, তারপর %@ে ট্যাপ করুন।
de: Füge einen Wecker hinzu oder bearbeite ihn und tippe auf %@.
es: Añade o edita una alarma y toca %@.
hi: अलार्म जोड़ें या बदलें, फिर %@ पर टैप करें।
pa: ਅਲਾਰਮ ਜੋੜੋ ਜਾਂ ਬਦਲੋ, ਫਿਰ %@ ਉੱਤੇ ਟੈਪ ਕਰੋ।
pt: Adicione ou edite um alarme e toque em %@.
ru: Добавьте или измените будильник, затем нажмите «%@».
zh: 添加或编辑闹钟，然后点按“%@”。

source: Addition
bn: যোগ
es: Suma
hi: जोड़
pa: ਜੋੜ
pt: Adição
ru: Сложение
zh: 加法

source: Addition & subtraction
bn: যোগ ও বিয়োগ
de: Addition & Subtraktion
es: Suma y resta
hi: जोड़ और घटाव
pa: ਜੋੜ ਅਤੇ ਘਟਾਓ
pt: Adição e subtração
ru: Сложение и вычитание
zh: 加法和减法

# Addition and subtraction
source: Addition & subtraction
bn: যোগ ও বিয়োগ
de: Addition & Subtraktion
es: Suma y resta
hi: जोड़ और घटाव
pa: ਜੋੜ ਅਤੇ ਘਟਾਓ
pt: Adição e subtração
ru: Сложение и вычитание
zh: 加法和减法

source: Alarm
bn: অ্যালার্ম
es: Alarma
hi: अलार्म
pa: ਅਲਾਰਮ
pt: Alarme
ru: Будильник
zh: 闹钟

source: Alarm ID
bn: অ্যালার্ম আইডি
de: Wecker-ID
es: ID de alarma
hi: अलार्म आईडी
pa: ਅਲਾਰਮ ਆਈਡੀ
pt: ID do alarme
ru: Идентификатор будильника
zh: 闹钟 ID

source: Alarm Order
bn: অ্যালার্মের ক্রম
de: Alarmreihenfolge
es: Orden de alarmas
hi: अलार्म क्रम
pa: ਅਲਾਰਮ ਕ੍ਰਮ
pt: Ordem dos alarmes
ru: Порядок будильников
zh: 闹钟排序

source: Alarm Title
bn: অ্যালার্ম শিরোনাম
de: Alarmtitel
es: Título de la alarma
hi: अलार्म शीर्षक
pa: ਅਲਾਰਮ ਸਿਰਲੇਖ
pt: Título do alarme
ru: Название будильника
zh: 闹钟标题

source: Alarm Tone (Default)
bn: অ্যালার্ম টোন (ডিফল্ট)
de: Standard-Alarmton
es: Tono de alarma (predeterminado)
hi: अलार्म स्वर (डिफ़ॉल्ट)
pa: ਅਲਾਰਮ ਟੋਨ (ਡਿਫਾਲਟ)
pt: Tom de alarme padrão
ru: Мелодия будильника (по умолчанию)
zh: 默认闹钟铃声

source: Alarm deleted.
bn: অ্যালার্ম মুছে ফেলা হয়েছে।
de: Alarm gelöscht.
es: Alarma eliminada.
hi: अलार्म मिटा दिया गया।
pa: ਅਲਾਰਮ ਮਿਟਾਇਆ ਗਿਆ।
pt: Alarme excluído.
ru: Будильник удалён.
zh: 闹钟已删除。

# Alarm permission required
source: Permission Required
bn: অনুমতি প্রয়োজন
de: Erforderliche Berechtigung
es: Permiso requerido
hi: अनुमति आवश्यक
pa: ਆਗਿਆ ਲੋੜੀਂਦੀ ਹੈ
pt: Permissão necessária
ru: Требуется разрешение
zh: 需要权限

source: Alarm recovery needs attention. Try again.
bn: অ্যালার্ম পুনরুদ্ধারে মনোযোগ দেওয়া প্রয়োজন। আবার চেষ্টা করুন।
de: Die erneute Alarmauslösung erfordert Aufmerksamkeit. Versuche es erneut.
es: La recuperación de la alarma necesita atención. Inténtalo de nuevo.
hi: अलार्म की रिकवरी पर ध्यान देने की ज़रूरत है। फिर कोशिश करें।
pa: ਅਲਾਰਮ ਦੀ ਰਿਕਵਰੀ ਵੱਲ ਧਿਆਨ ਦੇਣ ਦੀ ਲੋੜ ਹੈ। ਦੁਬਾਰਾ ਕੋਸ਼ਿਸ਼ ਕਰੋ।
pt: A recuperação do alarme precisa de atenção. Tente novamente.
ru: Восстановление будильника требует внимания. Попробуйте ещё раз.
zh: 闹钟恢复需要处理。请重试。

source: Alarm resolved
bn: অ্যালার্ম সমাধান হয়েছে
de: Wecker erledigt
es: Alarma resuelta
hi: अलार्म पूरा हुआ
pa: ਅਲਾਰਮ ਪੂਰਾ ਹੋਇਆ
pt: Alarme resolvido
ru: Будильник завершён
zh: 闹钟已处理

source: Alarm scheduled.
bn: অ্যালার্ম নির্ধারিত হয়েছে।
de: Alarm geplant.
es: Alarma programada.
hi: अलार्म निर्धारित हो गया।
pa: ਅਲਾਰਮ ਤਹਿ ਕੀਤਾ ਗਿਆ।
pt: Alarme agendado.
ru: Будильник запланирован.
zh: 闹钟已设定。

source: Alarm sound
bn: অ্যালার্মের শব্দ
de: Alarmton
es: Sonido de alarma
hi: अलार्म की ध्वनि
pa: ਅਲਾਰਮ ਦੀ ਆਵਾਜ਼
pt: Som do alarme
ru: Звук будильника
zh: 闹钟声音

# Alarm update failed
source: Couldn’t update alarm. Try again.
bn: অ্যালার্ম আপডেট করা যায়নি। আবার চেষ্টা করুন।
de: Wecker konnte nicht aktualisiert werden. Erneut versuchen.
es: No se pudo actualizar la alarma. Inténtalo de nuevo.
hi: अलार्म अपडेट नहीं हुआ। फिर कोशिश करें।
pa: ਅਲਾਰਮ ਅੱਪਡੇਟ ਨਹੀਂ ਹੋਇਆ। ਦੁਬਾਰਾ ਕੋਸ਼ਿਸ਼ ਕਰੋ।
pt: Não foi possível atualizar o alarme. Tente novamente.
ru: Не удалось обновить будильник. Повторите попытку.
zh: 无法更新闹钟，请重试。

source: Alarms
bn: অ্যালার্ম
de: Alarme
es: Alarmas
hi: अलार्म
pa: ਅਲਾਰਮ
pt: Alarmes
ru: Будильники
zh: 闹钟

source: Allow alarms
bn: অ্যালার্মের অনুমতি দিন
de: Alarme erlauben
es: Permitir alarmas
hi: अलार्म की अनुमति दें
pa: ਅਲਾਰਮ ਦੀ ਇਜਾਜ਼ਤ ਦਿਓ
pt: Permitir alarmes
ru: Разрешить будильники
zh: 允许闹钟

source: Allow alarms to schedule this alarm, then try saving again.
bn: এই অ্যালার্ম নির্ধারণ করতে অনুমতি দিন, তারপর আবার সংরক্ষণ করুন।
de: Erlaube Alarme, um diesen Alarm zu planen, und speichere ihn erneut.
es: Permite las alarmas para programar esta alarma y vuelve a guardarla.
hi: इसे निर्धारित करने के लिए अलार्म की अनुमति दें, फिर दोबारा सहेजें।
pa: ਇਸ ਅਲਾਰਮ ਨੂੰ ਤਹਿ ਕਰਨ ਲਈ ਇਜਾਜ਼ਤ ਦਿਓ, ਫਿਰ ਦੁਬਾਰਾ ਸੰਭਾਲੋ।
pt: Permita alarmes para agendar este alarme e tente salvar novamente.
ru: Разрешите будильники, чтобы запланировать этот будильник, затем сохраните его снова.
zh: 允许闹钟以设定此闹钟，然后重试保存。

source: Allow snooze
bn: স্নুজ করার অনুমতি দিন
de: Schlummern erlauben
es: Permitir posponer
hi: स्नूज़ की अनुमति दें
pa: ਸਨੂਜ਼ ਦੀ ਇਜਾਜ਼ਤ ਦਿਓ
pt: Permitir adiar
ru: Разрешить отсрочку
zh: 允许稍后提醒

source: Answer
bn: উত্তর
de: Antwort
es: Respuesta
hi: उत्तर
pa: ਜਵਾਬ
pt: Resposta
ru: Ответ
zh: 答案

source: Any unsaved changes to this alarm will be discarded.
bn: এই অ্যালার্মের সংরক্ষণ না করা পরিবর্তনগুলি বাতিল হবে।
de: Nicht gespeicherte Änderungen an diesem Wecker werden verworfen.
es: Se descartarán los cambios sin guardar de esta alarma.
hi: इस अलार्म के बिना सहेजे बदलाव हटा दिए जाएँगे।
pa: ਇਸ ਅਲਾਰਮ ਦੀਆਂ ਅਣਰੱਖਿਅਤ ਤਬਦੀਲੀਆਂ ਮਿਟਾ ਦਿੱਤੀਆਂ ਜਾਣਗੀਆਂ।
pt: As alterações não salvas neste alarme serão descartadas.
ru: Несохранённые изменения этого будильника будут потеряны.
zh: 对此闹钟未保存的更改将被舍弃。

source: App Settings
bn: অ্যাপ সেটিংস
de: App-Einstellungen
es: Ajustes de la aplicación
hi: ऐप सेटिंग्स
pa: ਐਪ ਸੈਟਿੰਗਜ਼
pt: Configurações do aplicativo
ru: Настройки приложения
zh: 应用设置

source: Apply challenge
bn: চ্যালেঞ্জ প্রয়োগ করুন
de: Aufgaben übernehmen
es: Aplicar reto
hi: चुनौती लागू करें
pa: ਚੁਣੌਤੀ ਲਾਗੂ ਕਰੋ
pt: Aplicar desafio
ru: Применить задание
zh: 应用挑战

source: Apply snooze settings
bn: স্নুজ সেটিংস প্রয়োগ করুন
de: Einstellungen übernehmen
es: Aplicar ajustes
hi: स्नूज़ सेटिंग लागू करें
pa: ਸਨੂਜ਼ ਸੈਟਿੰਗਾਂ ਲਾਗੂ ਕਰੋ
pt: Aplicar configurações
ru: Применить настройки
zh: 应用稍后提醒设置

source: Apps
bn: অ্যাপস
hi: ऐप्स
pa: ਐਪਾਂ
ru: Приложения
zh: App

source: Are you sure you want to clear the alarms?
bn: আপনি কি সত্যিই এই অ্যালার্মটি মুছতে চান?
de: Sind Sie sicher, dass Sie die Alarme löschen möchten?
es: ¿Estás seguro de que quieres borrar esta alarmas?
hi: क्या आप वाकई अलार्म साफ़ करना चाहते हैं?
pa: ਕੀ ਤੁਸੀਂ ਇਹ ਅਲਾਰਮ ਸਾਫ਼ ਕਰਨਾ ਚਾਹੁੰਦੇ ਹੋ?
pt: Tem certeza de que deseja limpar os alarmes?
ru: Вы уверены, что хотите сбросить сигналы тревоги?
zh: 您確定要清除警報嗎？

source: Back
bn: পিছনে
de: Zurück
es: Atrás
hi: वापस
pa: ਪਿੱਛੇ
pt: Voltar
ru: Назад
zh: 返回

source: Cancel
bn: বাতিল করুন
de: Stornieren
es: Cancelar
hi: रद्द करें
pa: ਰੱਦ ਕਰੋ
pt: Cancelar
ru: Отмена
zh: 取消

source: Challenge progress
bn: চ্যালেঞ্জের অগ্রগতি
de: Aufgabenfortschritt
es: Progreso del reto
hi: चुनौती की प्रगति
pa: ਚੁਣੌਤੀ ਦੀ ਪ੍ਰਗਤੀ
pt: Progresso do desafio
ru: Прогресс задач
zh: 挑战进度

# Challenge settings
source: Math challenge
bn: গণিত চ্যালেঞ্জ
de: Matheaufgabe
es: Reto matemático
hi: गणित चुनौती
pa: ਗਣਿਤ ਚੁਣੌਤੀ
pt: Desafio matemático
ru: Математическое задание
zh: 数学挑战

source: Change the alarm time, label and settings.
bn: অ্যালার্মের সময়, নাম ও সেটিংস পরিবর্তন করুন।
de: Ändere die Uhrzeit, die Beschriftung und die Einstellungen des Weckers.
es: Cambia la hora, la etiqueta y los ajustes de la alarma.
hi: अलार्म का समय, नाम और सेटिंग बदलें।
pa: ਅਲਾਰਮ ਦਾ ਸਮਾਂ, ਨਾਮ ਅਤੇ ਸੈਟਿੰਗਾਂ ਬਦਲੋ।
pt: Altere a hora, o nome e as configurações do alarme.
ru: Измените время, название и настройки будильника.
zh: 更改闹钟时间、标签和设置。

source: Changes apply to this draft. Save the alarm to keep them.
bn: পরিবর্তন এই খসড়ায় প্রযোজ্য। রাখতে অ্যালার্ম সংরক্ষণ করুন।
de: Änderungen gelten für diesen Entwurf. Speichere den Alarm, um sie zu behalten.
es: Los cambios se aplican a este borrador. Guarda la alarma para conservarlos.
hi: बदलाव इस ड्राफ़्ट में लागू हैं। उन्हें रखने के लिए अलार्म सहेजें।
pa: ਤਬਦੀਲੀਆਂ ਇਸ ਡਰਾਫ਼ਟ ਵਿੱਚ ਹਨ। ਉਹਨਾਂ ਨੂੰ ਰੱਖਣ ਲਈ ਅਲਾਰਮ ਸੰਭਾਲੋ।
pt: As alterações valem para este rascunho. Salve o alarme para mantê-las.
ru: Изменения относятся к черновику. Сохраните будильник, чтобы оставить их.
zh: 更改应用于此草稿。保存闹钟以保留更改。

source: Check out this cool alarm app
bn: এই চমৎকার অ্যালার্ম অ্যাপটি দেখুন
de: Dies ist eine coole Alarm-App
es: Echa un vistazo a esta genial aplicación de alarma
hi: इस शानदार अलार्म ऐप को देखें
pa: ਇਸ ਸ਼ਾਨਦਾਰ ਅਲਾਰਮ ਐਪ ਨੂੰ ਵੇਖੋ
pt: Compartilhar com outros
ru: Поделиться с другими
zh: 看看这个很酷的闹钟应用

source: Choose 1–30 minutes. Tap the number to type.
bn: ১–৩০ মিনিট বেছে নিন। লিখতে সংখ্যাটিতে ট্যাপ করুন।
de: Wähle 1–30 Minuten. Tippe zum Eingeben auf die Zahl.
es: Elige entre 1 y 30 minutos. Toca el número para escribir.
hi: 1–30 मिनट चुनें। टाइप करने के लिए संख्या पर टैप करें।
pa: 1–30 ਮਿੰਟ ਚੁਣੋ। ਟਾਈਪ ਕਰਨ ਲਈ ਨੰਬਰ ਉੱਤੇ ਟੈਪ ਕਰੋ।
pt: Escolha de 1 a 30 minutos. Toque no número para digitar.
ru: Выберите от 1 до 30 минут. Нажмите на число, чтобы ввести значение.
zh: 选择 1–30 分钟。 点按数字即可输入。

source: Choose a tone, then tap Done to apply it to this draft.
bn: ধ্বনি বেছে খসড়ায় প্রয়োগ করতে সম্পন্ন-এ ট্যাপ করুন।
de: Wähle einen Ton und tippe auf Fertig, um ihn auf diesen Entwurf anzuwenden.
es: Elige un tono y toca Listo para aplicarlo a este borrador.
hi: ध्वनि चुनें, फिर इसे ड्राफ़्ट में लागू करने के लिए पूर्ण पर टैप करें।
pa: ਧੁਨ ਚੁਣੋ, ਫਿਰ ਇਸਨੂੰ ਡਰਾਫ਼ਟ ਵਿੱਚ ਲਾਗੂ ਕਰਨ ਲਈ ਮੁਕੰਮਲ ਉੱਤੇ ਟੈਪ ਕਰੋ।
pt: Escolha um som e toque em Concluído para aplicá-lo ao rascunho.
ru: Выберите мелодию и нажмите «Готово», чтобы применить её к черновику.
zh: 选择铃声，然后轻点“完成”以应用于此草稿。

source: Choose a valid alarm time.
bn: অ্যালার্মের সঠিক সময় বেছে নিন।
de: Wähle eine gültige Alarmzeit.
es: Elige una hora válida.
hi: अलार्म का मान्य समय चुनें।
pa: ਅਲਾਰਮ ਦਾ ਸਹੀ ਸਮਾਂ ਚੁਣੋ।
pt: Escolha um horário válido.
ru: Выберите корректное время.
zh: 请选择有效的闹钟时间。

# Choose an alarm or add a new one.
source: Select an alarm or create a new one
bn: একটি অ্যালার্ম বেছে নিন বা নতুন তৈরি করুন
de: Wähle einen Wecker aus oder erstelle einen neuen
es: Selecciona una alarma o crea una nueva
hi: अलार्म चुनें या नया बनाएँ
pa: ਅਲਾਰਮ ਚੁਣੋ ਜਾਂ ਨਵਾਂ ਬਣਾਓ
pt: Selecione um alarme ou crie um novo
ru: Выберите будильник или создайте новый
zh: 选择闹钟或新建闹钟

source: Choose range
bn: সীমা বেছে নিন
de: Zahlenbereich wählen
es: Elegir rango
hi: सीमा चुनें
pa: ਸੀਮਾ ਚੁਣੋ
pt: Escolher intervalo
ru: Выбрать диапазон
zh: 选择范围

source: Choose the sound used by this alarm.
bn: এই অ্যালার্মের ধ্বনি বেছে নিন।
de: Wähle den Ton für diesen Wecker.
es: Elige el sonido de esta alarma.
hi: इस अलार्म की ध्वनि चुनें।
pa: ਇਸ ਅਲਾਰਮ ਦੀ ਧੁਨ ਚੁਣੋ।
pt: Escolha o som deste alarme.
ru: Выберите звук для этого будильника.
zh: 选择此闹钟使用的铃声。

source: Choose valid weekdays.
bn: সপ্তাহের সঠিক দিন বেছে নিন।
de: Wähle gültige Wochentage.
es: Elige días válidos.
hi: सप्ताह के मान्य दिन चुनें।
pa: ਹਫ਼ਤੇ ਦੇ ਸਹੀ ਦਿਨ ਚੁਣੋ।
pt: Escolha dias da semana válidos.
ru: Выберите корректные дни недели.
zh: 请选择有效的星期。

source: Choose whether alarms appear by when they were created or by the time they go off.
bn: অ্যালার্মগুলো তৈরি হওয়ার ক্রমে নাকি বাজানোর সময়ে দেখাবে তা বেছে নিন।
de: Wahle, ob Alarme nach ihrer Erstellung oder nach ihrer Auslosezeit angezeigt werden.
es: Elige si las alarmas aparecen por orden de creacion o por la hora en que suenan.
hi: चुनें कि अलार्म उनके बनाए जाने के क्रम में दिखें या बजने के समय के अनुसार।
pa: ਚੁਣੋ ਕਿ ਅਲਾਰਮ ਬਣਾਉਣ ਦੇ ਕ੍ਰਮ ਅਨੁਸਾਰ ਦਿਖਾਏ ਜਾਣ ਜਾਂ ਵੱਜਣ ਦੇ ਸਮੇਂ ਅਨੁਸਾਰ।
pt: Escolha se os alarmes aparecem pela ordem de criacao ou pelo horario em que tocam.
ru: Выберите, показывать будильники по порядку создания или по времени срабатывания.
zh: 选择按创建顺序显示闹钟，或按响铃时间显示闹钟。

source: Clear
bn: পরিষ্কার করুন
de: Klar
es: Borrar
hi: साफ़ करें
pa: ਸਾਫ਼ ਕਰੋ
pt: Claro
ru: Очистить
zh: 清除

source: Clear Alarms
bn: অ্যালার্ম মুছুন
de: Klare Alarme
es: Borrar alarma
hi: अलार्म साफ़ करें
pa: ਅਲਾਰਮ ਸਾਫ਼ ਕਰੋ
pt: Limpar alarmes
ru: Удалить будильник
zh: 清除闹钟

source: Close this editor?
bn: সম্পাদক বন্ধ করবেন?
de: Bearbeitung schließen?
es: ¿Cerrar el editor?
hi: संपादक बंद करें?
pa: ਸੰਪਾਦਕ ਬੰਦ ਕਰਨਾ ਹੈ?
pt: Fechar o editor?
ru: Закрыть редактор?
zh: 关闭编辑器？

source: Color Theme
bn: রঙের থিম
de: Farbthema
es: Tema de color
hi: रंग थीम
pa: ਰੰਗ ਥੀਮ
pt: Tema de cor
ru: Цветовая тема
zh: 颜色主题

source: Confirm
bn: নিশ্চিত করুন
de: Bestätigen
es: Confirmar
hi: पुष्टि करें
pa: ਪੁਸ਼ਟੀ ਕਰੋ
pt: Confirmar
ru: Подтвердить
zh: 确认

source: Couldn’t dismiss alarm. Try again.
bn: অ্যালার্ম বন্ধ করা যায়নি। আবার চেষ্টা করুন।
de: Wecker konnte nicht beendet werden. Erneut versuchen.
es: No se pudo detener la alarma. Inténtalo de nuevo.
hi: अलार्म बंद नहीं हुआ। फिर कोशिश करें।
pa: ਅਲਾਰਮ ਬੰਦ ਨਹੀਂ ਹੋਇਆ। ਦੁਬਾਰਾ ਕੋਸ਼ਿਸ਼ ਕਰੋ।
pt: Não foi possível parar o alarme. Tente novamente.
ru: Не удалось остановить будильник. Повторите попытку.
zh: 无法关闭闹钟，请重试。

source: Couldn’t open the requested action. Try again.
bn: অনুরোধ করা কাজটি খোলা যায়নি। আবার চেষ্টা করুন।
de: Die gewünschte Aktion konnte nicht geöffnet werden. Versuche es erneut.
es: No se pudo abrir la acción solicitada. Inténtalo de nuevo.
hi: अनुरोधित कार्रवाई नहीं खुल सकी। फिर कोशिश करें।
pa: ਬੇਨਤੀ ਕੀਤੀ ਕਾਰਵਾਈ ਨਹੀਂ ਖੁੱਲ੍ਹ ਸਕੀ। ਮੁੜ ਕੋਸ਼ਿਸ਼ ਕਰੋ।
pt: Não foi possível abrir a ação solicitada. Tente novamente.
ru: Не удалось открыть запрошенное действие. Попробуйте ещё раз.
zh: 无法打开请求的操作。请重试。

source: Couldn’t prepare this challenge. Try again.
bn: এই চ্যালেঞ্জ প্রস্তুত করা যায়নি। আবার চেষ্টা করুন।
de: Diese Aufgaben konnten nicht vorbereitet werden. Versuche es erneut.
es: No se pudo preparar este reto. Inténtalo de nuevo.
hi: यह चुनौती तैयार नहीं हो सकी। फिर कोशिश करें।
pa: ਇਹ ਚੁਣੌਤੀ ਤਿਆਰ ਨਹੀਂ ਹੋ ਸਕੀ। ਦੁਬਾਰਾ ਕੋਸ਼ਿਸ਼ ਕਰੋ।
pt: Não foi possível preparar este desafio. Tente novamente.
ru: Не удалось подготовить задачи. Попробуйте ещё раз.
zh: 无法准备此挑战。请重试。

source: Couldn’t save alarm. Try again.
bn: অ্যালার্ম সেভ করা যায়নি। আবার চেষ্টা করুন।
de: Wecker konnte nicht gespeichert werden. Erneut versuchen.
es: No se pudo guardar la alarma. Inténtalo de nuevo.
hi: अलार्म सेव नहीं हुआ। फिर कोशिश करें।
pa: ਅਲਾਰਮ ਸੇਵ ਨਹੀਂ ਹੋਇਆ। ਦੁਬਾਰਾ ਕੋਸ਼ਿਸ਼ ਕਰੋ।
pt: Não foi possível salvar o alarme. Tente novamente.
ru: Не удалось сохранить будильник. Повторите попытку.
zh: 无法保存闹钟，请重试。

source: Couldn’t schedule alarm. Save it again.
bn: অ্যালার্ম সেট করা যায়নি। আবার সেভ করুন।
de: Wecker konnte nicht gestellt werden. Erneut speichern.
es: No se pudo programar la alarma. Guárdala de nuevo.
hi: अलार्म सेट नहीं हुआ। फिर से सेव करें।
pa: ਅਲਾਰਮ ਸੈੱਟ ਨਹੀਂ ਹੋਇਆ। ਦੁਬਾਰਾ ਸੇਵ ਕਰੋ।
pt: Não foi possível agendar o alarme. Salve novamente.
ru: Не удалось установить будильник. Сохраните его ещё раз.
zh: 无法设置闹钟，请重新保存。

source: Couldn’t send feedback. Try again.
bn: মতামত পাঠানো যায়নি। আবার চেষ্টা করুন।
de: Feedback konnte nicht gesendet werden. Versuche es erneut.
es: No se pudieron enviar los comentarios. Inténtalo de nuevo.
hi: प्रतिक्रिया नहीं भेजी जा सकी। फिर कोशिश करें।
pa: ਪ੍ਰਤੀਕ੍ਰਿਆ ਨਹੀਂ ਭੇਜੀ ਜਾ ਸਕੀ। ਮੁੜ ਕੋਸ਼ਿਸ਼ ਕਰੋ।
pt: Não foi possível enviar comentários. Tente novamente.
ru: Не удалось отправить отзыв. Попробуйте ещё раз.
zh: 无法发送反馈。请重试。

source: Couldn’t snooze alarm. Try again.
bn: অ্যালার্ম স্নুজ করা যায়নি। আবার চেষ্টা করুন।
de: Wecker konnte nicht verschoben werden. Erneut versuchen.
es: No se pudo posponer la alarma. Inténtalo de nuevo.
hi: अलार्म स्नूज़ नहीं हुआ। फिर कोशिश करें।
pa: ਅਲਾਰਮ ਸਨੂਜ਼ ਨਹੀਂ ਹੋਇਆ। ਦੁਬਾਰਾ ਕੋਸ਼ਿਸ਼ ਕਰੋ।
pt: Não foi possível adiar o alarme. Tente novamente.
ru: Не удалось отложить будильник. Повторите попытку.
zh: 无法稍后提醒，请重试。

source: Couldn’t update alarm. Try again.
bn: অ্যালার্ম আপডেট করা যায়নি। আবার চেষ্টা করুন।
de: Wecker konnte nicht aktualisiert werden. Erneut versuchen.
es: No se pudo actualizar la alarma. Inténtalo de nuevo.
hi: अलार्म अपडेट नहीं हुआ। फिर कोशिश करें।
pa: ਅਲਾਰਮ ਅੱਪਡੇਟ ਨਹੀਂ ਹੋਇਆ। ਦੁਬਾਰਾ ਕੋਸ਼ਿਸ਼ ਕਰੋ।
pt: Não foi possível atualizar o alarme. Tente novamente.
ru: Не удалось обновить будильник. Повторите попытку.
zh: 无法更新闹钟，请重试。

source: Couldn’t update preferences. Try again.
bn: সেটিংস আপডেট করা যায়নি। আবার চেষ্টা করুন।
de: Einstellungen konnten nicht aktualisiert werden. Erneut versuchen.
es: No se pudieron actualizar las preferencias. Inténtalo de nuevo.
hi: सेटिंग अपडेट नहीं हुईं। फिर कोशिश करें।
pa: ਸੈਟਿੰਗਾਂ ਅੱਪਡੇਟ ਨਹੀਂ ਹੋਈਆਂ। ਦੁਬਾਰਾ ਕੋਸ਼ਿਸ਼ ਕਰੋ।
pt: Não foi possível atualizar as preferências. Tente novamente.
ru: Не удалось обновить настройки. Повторите попытку.
zh: 无法更新偏好设置，请重试。

source: Couldn’t update settings. Try again.
bn: সেটিংস আপডেট করা যায়নি। আবার চেষ্টা করুন।
de: Einstellungen konnten nicht aktualisiert werden. Erneut versuchen.
es: No se pudieron actualizar los ajustes. Inténtalo de nuevo.
hi: सेटिंग अपडेट नहीं हुईं। फिर कोशिश करें।
pa: ਸੈਟਿੰਗਾਂ ਅੱਪਡੇਟ ਨਹੀਂ ਹੋਈਆਂ। ਦੁਬਾਰਾ ਕੋਸ਼ਿਸ਼ ਕਰੋ।
pt: Não foi possível atualizar as configurações. Tente novamente.
ru: Не удалось обновить настройки. Повторите попытку.
zh: 无法更新设置，请重试。

source: Creation Order
bn: তৈরির ক্রম
de: Erstellungsreihenfolge
es: Orden de creación
hi: बनाने का क्रम
pa: ਬਣਾਉਣ ਦਾ ਕ੍ਰਮ
pt: Ordem de criação
ru: По порядку создания
zh: 创建顺序

source: Current sound
bn: বর্তমান শব্দ
de: Aktueller Ton
es: Sonido actual
hi: वर्तमान ध्वनि
pa: ਮੌਜੂਦਾ ਆਵਾਜ਼
pt: Som atual
ru: Текущий звук
zh: 当前声音

source: Custom
bn: নিজস্ব
de: Individuell
es: Personalizada
hi: कस्टम
pa: ਕਸਟਮ
pt: Personalizada
ru: Своя настройка
zh: 自定义

source: Dark
bn: ডার্ক
de: Dunkel
es: Oscuro
hi: डार्क
pa: ਡਾਰਕ
pt: Escuro
ru: Темный
zh: 深色

# Default alarm tone
source: Alarm Tone (Default)
bn: অ্যালার্ম টোন (ডিফল্ট)
de: Standard-Alarmton
es: Tono de alarma (predeterminado)
hi: अलार्म स्वर (डिफ़ॉल्ट)
pa: ਅਲਾਰਮ ਟੋਨ (ਡਿਫਾਲਟ)
pt: Tom de alarme padrão
ru: Мелодия будильника (по умолчанию)
zh: 默认闹钟铃声

source: Delete
bn: মুছে ফেলুন
de: Löschen
es: Eliminar
hi: हटाएं
pa: ਹਟਾਓ
pt: Excluir
ru: Удалить
zh: 删除

source: Delete All
bn: সব মুছে ফেলুন
de: Alle löschen
es: Eliminar todo
hi: सभी हटाएं
pa: ਸਭ ਨੂੰ ਹਟਾਓ
pt: Excluir tudo
ru: Удалить все
zh: 删除所有

# Delete all alarms
source: Delete All
bn: সব মুছে ফেলুন
de: Alle löschen
es: Eliminar todo
hi: सभी हटाएं
pa: ਸਭ ਨੂੰ ਹਟਾਓ
pt: Excluir tudo
ru: Удалить все
zh: 删除所有

# Delete all alarms?
source: Are you sure you want to clear the alarms?
bn: আপনি কি সত্যিই এই অ্যালার্মটি মুছতে চান?
de: Sind Sie sicher, dass Sie die Alarme löschen möchten?
es: ¿Estás seguro de que quieres borrar esta alarmas?
hi: क्या आप वाकई अलार्म साफ़ करना चाहते हैं?
pa: ਕੀ ਤੁਸੀਂ ਇਹ ਅਲਾਰਮ ਸਾਫ਼ ਕਰਨਾ ਚਾਹੁੰਦੇ ਹੋ?
pt: Tem certeza de que deseja limpar os alarmes?
ru: Вы уверены, что хотите сбросить сигналы тревоги?
zh: 您確定要清除警報嗎？

source: Delivery could not be decoded. It remains queued for retry.
bn: অ্যালার্মের ডেলিভারি পড়া যায়নি। আবার চেষ্টা করার জন্য এটি সারিতে রয়েছে।
de: Der ausgelöste Alarm konnte nicht gelesen werden. Er bleibt für einen erneuten Versuch in der Warteschlange.
es: No se pudo leer la entrega. Permanece en la cola para reintentar.
hi: अलार्म डिलीवरी पढ़ी नहीं जा सकी। दोबारा कोशिश के लिए वह कतार में बनी हुई है।
pa: ਅਲਾਰਮ ਡਿਲੀਵਰੀ ਪੜ੍ਹੀ ਨਹੀਂ ਜਾ ਸਕੀ। ਦੁਬਾਰਾ ਕੋਸ਼ਿਸ਼ ਲਈ ਉਹ ਕਤਾਰ ਵਿੱਚ ਰਹੇਗੀ।
pt: Não foi possível ler o alarme acionado. Ele permanece na fila para uma nova tentativa.
ru: Не удалось прочитать данные срабатывания. Они остаются в очереди для повторной попытки.
zh: 无法读取闹钟触发数据。它仍在队列中，可供重试。

source: Difficulty
bn: কঠিনতা
de: Schwierigkeit
es: Dificultad
hi: कठिनाई
pa: ਮੁਸ਼ਕਲ
pt: Dificuldade
ru: Сложность
zh: 难度

source: Discard changes
bn: পরিবর্তন বাতিল করুন
de: Änderungen verwerfen
es: Descartar cambios
hi: बदलाव हटाएँ
pa: ਤਬਦੀਲੀਆਂ ਮਿਟਾਓ
pt: Descartar alterações
ru: Отменить изменения
zh: 舍弃更改

# Discard draft
source: Discard changes
bn: পরিবর্তন বাতিল করুন
de: Änderungen verwerfen
es: Descartar cambios
hi: बदलाव हटाएँ
pa: ਤਬਦੀਲੀਆਂ ਮਿਟਾਓ
pt: Descartar alterações
ru: Отменить изменения
zh: 舍弃更改

source: Discard selection
bn: নির্বাচন বাতিল করুন
de: Auswahl verwerfen
es: Descartar selección
hi: चयन छोड़ें
pa: ਚੋਣ ਛੱਡੋ
pt: Descartar seleção
ru: Отменить выбор
zh: 放弃选择

source: Discard sound selection?
bn: ধ্বনি নির্বাচন বাতিল করবেন?
de: Tonauswahl verwerfen?
es: ¿Descartar la selección de sonido?
hi: ध्वनि चयन छोड़ें?
pa: ਧੁਨ ਦੀ ਚੋਣ ਛੱਡਣੀ ਹੈ?
pt: Descartar a seleção de som?
ru: Отменить выбор мелодии?
zh: 放弃铃声选择？

# Discard this unsaved draft?
source: Close this editor?
bn: সম্পাদক বন্ধ করবেন?
de: Bearbeitung schließen?
es: ¿Cerrar el editor?
hi: संपादक बंद करें?
pa: ਸੰਪਾਦਕ ਬੰਦ ਕਰਨਾ ਹੈ?
pt: Fechar o editor?
ru: Закрыть редактор?
zh: 关闭编辑器？

source: Dismiss keyboard
bn: কিবোর্ড বন্ধ করুন
de: Tastatur ausblenden
es: Ocultar teclado
hi: कीबोर्ड बंद करें
pa: ਕੀਬੋਰਡ ਬੰਦ ਕਰੋ
pt: Ocultar teclado
ru: Скрыть клавиатуру
zh: 收起键盘

source: Division
bn: ভাগ
es: División
hi: भाग
pa: ਭਾਗ
pt: Divisão
ru: Деление
zh: 除法

source: Done
bn: সম্পন্ন
de: Fertig
es: Listo
hi: पूर्ण
pa: ਮੁਕੰਮਲ
pt: Concluído
ru: Готово
zh: 完成

source: Duration (minutes)
bn: সময়কাল (মিনিট)
de: Dauer (Minuten)
es: Duración (minutos)
hi: अवधि (मिनट)
pa: ਮਿਆਦ (ਮਿੰਟ)
pt: Duração (minutos)
ru: Длительность (минуты)
zh: 时长（分钟）

source: Easiest first
bn: আগে সহজ প্রশ্ন
de: Leichteste zuerst
es: Más fáciles primero
hi: पहले आसान सवाल
pa: ਪਹਿਲਾਂ ਸੌਖੇ ਸਵਾਲ
pt: Mais fáceis primeiro
ru: Сначала простые
zh: 从易到难

source: Easy
bn: সহজ
de: Leicht
es: Fácil
hi: आसान
pa: ਸੌਖਾ
pt: Fácil
ru: Легко
zh: 简单

source: Easy: %@ · Medium: %@
bn: সহজ: %@ · মাঝারি: %@
de: Leicht: %@ · Mittel: %@
es: Fácil: %@ · Media: %@
hi: आसान: %@ · मध्यम: %@
pa: ਸੌਖੇ: %@ · ਦਰਮਿਆਨੇ: %@
pt: Fácil: %@ · Média: %@
ru: Легко: %@ · Средне: %@
zh: 简单：%@ · 中等：%@

source: Edit
bn: সম্পাদনা করুন
de: Bearbeiten
es: Editar
hi: संपादित करें
pa: ਸੋਧੋ
pt: Editar
ru: Редактировать
zh: 编辑

source: Edit alarm
bn: অ্যালার্ম সম্পাদনা করুন
de: Alarm bearbeiten
es: Editar alarma
hi: अलार्म संपादित करें
pa: ਅਲਾਰਮ ਸੋਧੋ
pt: Editar alarme
ru: Изменить будильник
zh: 编辑闹钟

source: Electronic rhythm · insistent
bn: ইলেকট্রনিক ছন্দ · অবিরাম
de: Elektronischer Rhythmus · eindringlich
es: Ritmo electrónico · insistente
hi: इलेक्ट्रॉनिक लय · लगातार
pa: ਇਲੈਕਟ੍ਰਾਨਿਕ ਲੈਅ · ਲਗਾਤਾਰ
pt: Ritmo eletrónico · insistente
ru: Электронный ритм · настойчивый
zh: 电子节奏 · 持续
